(in-package :xvc)

(defvar code
  '(("9N001000000000001" :description "身長"
     :type :integer :format "NNN.N" :max 250.0 :min 100.0)
    ("9N006000000000001" :description "体重"
     :type :integer :format "NNN.N" :max 250.0 :min 20.0)
    ("9N011000000000001" :description "BMI"
     :type :integer :format "NN.N" :max 100.0 :min 10.0)
    ("9N021000000000001" :description "内臓脂肪面積"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("9N016160100000001" :description "腹囲(実測)"
     :type :integer :format "NNN.N" :max 250.0 :min 40.0)
    ("9N016160200000001" :description "腹囲(自己判定)"
     :type :integer :format "NNN.N" :max 250.0 :min 40.0)
    ("9N016160300000001" :description "腹囲(自己申告)"
     :type :integer :format "NNN.N" :max 250.0 :min 40.0)
    ("9N026000000000002" :description "肥満度"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("9N051000000000049" :description "業務歴"
     :type :string :length 256)
    ("9N056000000000011" :description "既往歴"
     :type :code :selectable '("1" "2"))
    ("9N056160400000049" :description "具体的な既往歴"
     :type :string :length 256)
    ("9N061000000000011" :description "自覚症状"
     :type :code :selectable '("1" "2"))
    ("9N061160800000049" :description "自覚症状所見"
     :type :string :length 256)
    ("9N066000000000011" :description "他覚症状"
     :type :code :selectable '("1" "2"))
    ("9N066160800000049" :description "他覚症状所見"
     :type :string :length 256)
    ("9N071000000000049" :description "家族歴など"
     :type :string :length 256)
    ("9N076000000000049" :description "視診"
     :type :string :length 256)
    ("9N081000000000049" :description "打聴診"
     :type :string :length 256)
    ("9N086000000000049" :description "触診"
     :type :string :length 256)
    ("9N091000000000001" :description "反復唾液嚥下テスト"
     :type :integer :format "N" :max 9 :min 0)
    ("9A755000000000001" :description "収縮期血圧(その他)"
     :type :integer :format "NNN" :max 300 :min 60)
    ("9A752000000000001" :description "収縮期血圧(2回目)"
     :type :integer :format "NNN" :max 300 :min 60)
    ("9A751000000000001" :description "収縮期血圧(1回目)"
     :type :integer :format "NNN" :max 300 :min 60)
    ("9A765000000000001" :description "拡張期血圧(その他)"
     :type :integer :format "NNN" :max 150 :min 30)
    ("9A762000000000001" :description "拡張期血圧(2回目)"
     :type :integer :format "NNN" :max 150 :min 30)
    ("9A761000000000001" :description "拡張期血圧(1回目)"
     :type :integer :format "NNN" :max 150 :min 30)
    ("9N121000000000001" :description "心拍数"
     :type :integer :format "NNN" :max 900 :min 0)
    ("9N141000000000011" :description "食後採血時間"
     :type :code :selectable '("1" "2"))
    ("3F050000002327101" :description "総コレステロール"
     :type :integer :format "NNNNN" :max 99999 :min 0)
    ("3F050000002327201" :description "総コレステロール"
     :type :integer :format "NNNNN" :max 99999 :min 0)
    ("3F050000002399901" :description "総コレステロール"
     :type :integer :format "NNNNN" :max 99999 :min 0)
    ("3F015000002327101" :description "中性脂肪"
     :type :integer :format "NNNNN" :max 2000 :min 10)
    ("3F015000002327201" :description "中性脂肪"
     :type :integer :format "NNNNN" :max 2000 :min 10)
    ("3F015000002399901" :description "中性脂肪"
     :type :integer :format "NNNNN" :max 2000 :min 10)
    ("3F070000002327101" :description "HDLコレステロール"
     :type :integer :format "NNNNN" :max 500 :min 10)
    ("3F070000002327201" :description "HDLコレステロール"
     :type :integer :format "NNNNN" :max 500 :min 10)
    ("3F070000002399901" :description "HDLコレステロール"
     :type :integer :format "NNNNN" :max 500 :min 10)
    ("3F077000002327101" :description "LDLコレステロール"
     :type :integer :format "NNNNN" :max 1000 :min 20)
    ("3F077000002327201" :description "LDLコレステロール"
     :type :integer :format "NNNNN" :max 1000 :min 20)
    ("3F077000002399901" :description "LDLコレステロール"
     :type :integer :format "NNNNN" :max 1000 :min 20)
    ("3J010000002327101" :description "総ビリルビン"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("3J010000002399901" :description "総ビリルビン"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("3B035000002327201" :description "GOT(AST)"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B035000002399901" :description "GOT(AST)"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B045000002327201" :description "GPT(ALT)"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B045000002399901" :description "GPT(ALT)"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B090000002327101" :description "γ-GTP"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B090000002399901" :description "γ-GTP"
     :type :integer :format "NNNNN" :max 1000 :min 0)
    ("3B070000002327101" :description "ALP"
     :type :integer :format "NNNNN" :max 99999 :min 0)
    ("3B070000002399901" :description "ALP"
     :type :integer :format "NNNNN" :max 99999 :min 0)
    ("3C015000002327101" :description "血清クレアチニン"
     :type :integer :format "NN.NN" :max 99.99 :min 0.00)
    ("3C015000002399901" :description "血清クレアチニン"
     :type :integer :format "NN.NN" :max 99.99 :min 0.00)
    ("3C020000002327101" :description "血清尿酸"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3C020000002399901" :description "血清尿酸"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3A010000002327101" :description "総蛋白"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3A010000002399901" :description "総蛋白"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3A015000002327101" :description "アルブミン"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3A015000002399901" :description "アルブミン"
     :type :integer :format "NN.N" :max 99.9 :min 0.0)
    ("3A016000002327102" :description "A/G"
     :type :integer :format "NN.NN" :max 99.99 :min 0.00)
    ("5C095000002302301" :description "血清フェリチン"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("5C095000002399901" :description "血清フェリチン"
     :type :integer :format "NNN.N" :max 999.9 :min 0.0)
    ("3D010000001926101" :description "空腹時血糖"
     :type :integer :format "NNN" :max 600 :min 20)
    ("3D010000002227101" :description "空腹時血糖"
     :type :integer :format "NNN" :max 600 :min 20)
    ("3D010000001927201" :description "空腹時血糖"
     :type :integer :format "NNN" :max 600 :min 20)
    ("3D010000001999901" :description "空腹時血糖"
     :type :integer :format "NNN" :max 600 :min 20)
    ("3D010129901926101" :description "随時血糖"
     :type :integer :format "NNNN" :max 9999 :min 0)
    ("3D010129902227101"  :description "随時血糖"
     :type :integer :format "NNNN" :max 9999 :min 0)
    ("3D010129901927201" :description "随時血糖"
     :type :integer :format "NNNN" :max 9999 :min 0)
    ("3D010129901999901" :description "随時血糖"
     :type :integer :format "NNNN" :max 9999 :min 0)
    ("3D046000001906202" )
    ("3D046000001920402")
    ("3D046000001927102")
    ("3D046000001999902")
    ("3D045000001906202")
    ("3D045000001920402")
    ("3D045000001927102")
    ("3D045000001999902")
    ("1A020000000191111")
    ("1A020000000190111")
    ("1A010000000191111")
    ("1A010000000190111")
    ("1A100000000191111")
    ("1A100000000190111")
    ("1A105160700166211")
    ("1A105160800166249")
    ("1A030000000190301")
    ("1A030000000199901")
    ("2A040000001930102")
    ("2A030000001930101")
    ("2A020000001930101")
    ("2A020161001930149")
    ("2A060000001930101")
    ("2A070000001930101")
    ("2A080000001930101")
    ("2A010000001930101")
    ("2A050000001930101")
    ("9A110160700000011")
    ("9A110160800000049")
    ("9A110161000000049")
    ("9N201000000000011")
    ("9N206160700000011")
    ("9N206160800000049")
    ("9N211161100000049")
    ("9N211161200000049")
    ("9N216000000000011")
    ("9N221160700000011")
    ("9N221160800000049")
    ("9N226161100000049")
    ("9N226161200000049")
    ("6A010160706170411")
    ("6A010160806170449")
    ("6A205000006171711")
    ("6A205165606171711")
    ("7A010000006143311")
    ("9N251000000000011")
    ("9N251160700000011")
    ("9N251160800000049")
    ("9N251161100000049")
    ("9N251161200000049")
    ("9N256160700000011")
    ("9N256160800000049")
    ("9N256161100000049")
    ("9N256161200000049")
    ("9N261160700000011")
    ("9N261160800000049")
    ("9N261161100000049")
    ("9N261161200000049")
    ("9N266160700000011")
    ("9N266160800000049")
    ("3B339000002399811")
    ("9F130160700000011")
    ("9F130160800000049")
    ("9N271160700000011")
    ("9N271160800000049")
    ("9N276160700000011")
    ("9N276160800000049")
    ("9N281160700000011")
    ("9N281160800000049")
    ("9F140160700000011")
    ("9F140160800000049")
    ("9N291160700000011")
    ("9N291160800000049")
    ("9N296160700000011")
    ("9N296160800000049")
    ("7A021165008543311")
    ("7A021165108543311")
    ("7A022000008543311")
    ("9Z771160700000011")
    ("9Z771160800000049")
    ("9Z770160700000011")
    ("9Z770160800000049")
    ("1B030000001599811")
    ("5D305000002399811")
    ("9C310000000000001")
    ("9C320000000000001")
    ("9C330000000000002")
    ("9C380000000000002")
    ("9E160162100000001")
    ("9E160162500000001")
    ("9E160162200000001")
    ("9E160162600000001")
    ("9D100163100000011")
    ("9D100163200000011")
    ("9D100163500000011")
    ("9D100163600000011")
    ("9D100164000000011")
    ("9D100160900000049")
    ("9E100166000000011")
    ("9E100166100000011")
    ("9E100166200000011")
    ("9E100166300000011")
    ("9E100160900000049")
    ("9E100161000000049")
    ("9E105162100000001")
    ("9E105162200000001")
    ("5C070000002306201")
    ("5C070000002306301")
    ("5C070000002399901")
    ("5H010000001910111")
    ("5H010000001999911")
    ("5H020000001910111")
    ("5H020000001999911")
    ("5E071000002399811")
    ("5F016141002399811")
    ("5F360149502399811")
    ("5F360149702399811")
    ("5F360150002399811")
    ("5F360145002399811")
    ("9N401000000000011")
    ("9N406000000000049")
    ("9N411000000000049")
    ("9N416000000000049")
    ("9N501000000000011")
    ("9N506000000000011")
    ("9N511000000000049")
    ("9N516000000000049")
    ("9N521000000000049")
    ("9N526000000000049")
    ("9N531000000000049")
    ("9N536000000000049")
    ("9N541000000000049")
    ("9N546000000000049")
    ("9N551000000000049")
    ("9N556000000000011")
    ("9N561000000000011")
    ("9N566000000000049")
    ("9N571000000000049")
    ("9N576000000000049")
    ("9N581161300000011")
    ("9N581161400000049")
    ("9N586000000000049")
    ("9N591161300000011")
    ("9N591161400000049")
    ("9N596000000000049")
    ("9N601161300000011")
    ("9N601161400000049")
    ("9N606000000000049")
    ("9N611161300000011")
    ("9N611161400000049")
    ("9N616000000000049")
    ("9N621161300000011")
    ("9N621161400000049")
    ("9N626000000000049")
    ("9N631161300000011")
    ("9N631161400000049")
    ("9N636000000000049")
    ("9N641000000000049")
    ("9N646000000000049")
    ("9N701000000000011")
    ("9N701167000000049")
    ("9N701167100000049")
    ("9N706000000000011")
    ("9N706167000000049")
    ("9N706167100000049")
    ("9N711000000000011")
    ("9N711167000000049")
    ("9N711167100000049")
    ("9N716000000000011")
    ("9N721000000000011")
    ("9N726000000000011")
    ("9N731000000000011")
    ("9N736000000000011")
    ("9N741000000000011")
    ("9N746000000000011")
    ("9N751000000000011")
    ("9N756000000000011")
    ("9N761000000000011")
    ("9N766000000000011")
    ("9N771000000000011")
    ("9N776000000000011")
    ("9N781000000000011")
    ("9N786000000000011")
    ("9N791000000000011")
    ("9N796000000000011")
    ("9N801000000000011")
    ("9N806000000000011")
    ("9N811000000000011")
    ("9N816000000000011")
    ("9N821000000000011")
    ("9N826000000000011")
    ("9N831000000000011")
    ("9N836000000000011")
    ("9N841000000000011")
    ("9N846000000000011")
    ("9N851000000000011")
    ("9N856000000000011")
    ("9N861000000000011")
    ("9N866000000000001")
    ("9N871000000000011")
    ("9N876000000000011")
    ("9N881000000000011")
    ("9N886000000000011")
    ("9N891000000000011")
    ("9N896000000000011")
    ("9N901000000000011")
    ("9N906000000000011")
    ("9N911000000000011")
    ("9N916000000000011")
    ("9N921000000000011")
    ("9N926000000000011")
    ("9N931000000000011")))

(in-package :cl-user)
